<template >
    <div>
       <div class="page-title">
            <h3>Договор</h3>
        </div>
        <div>
                    {{USER.LastName}} {{USER.Name}} {{USER.SecondName}}, паспорт {{USER.Seriya}} № {{USER.Nomer}} выдан {{USER.KemKogda}}, именуемый (ая) в дальнейшем «Покупатель», с одной стороны, и Индивидуальный предприниматель Сидоров Максим Александрович, именуемый в дальнейшем «Продавец», действующего на основании ОГРНИП 319112100030761, с другой стороны, вместе именуемые «Стороны», заключили настоящий Договор о нижеследующем:
                    1. ПРЕДМЕТ ДОГОВОРА

                    1.1. Продавец обязуется передать в собственность Покупателя, а Покупатель обязуется своевременно принять, оплатить и осуществить с использованием своего транспорта вывоз пищевых отходов 5 класса, не подлежащий лицензированию, ежедневно в соответствии с согласованным графиком, в объемах согласно настоящему Договору.

                    1.2. Под пищевыми отходами Стороны понимают не подлежащие использованию по прямому назначению пищевые продукты, которые полностью или частично потеряли свои первоначальные потребительские свойства и (или) внешний товарный вид, образованные в процессе хозяйственной деятельности на объектах, указанных в п.1.1 настоящего Договора.

                    Вывоз пищевых отходов производится по графику, согласованному Сторонами в любой электронной форме, указанной в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора.

                    1.3. Изменение перечня отгружаемой продукции, подлежащей ежедневной отгрузке, допускается.
                    2. ОБЯЗАННОСТИ СТОРОН

                    2.1. Покупатель обязан:

                    2.1.1. Обеспечить собственными силами и средствами (собственным транспортом и тарой) вывоз отходов с территории объекта, указанного в п.1.1 настоящего Договора, исходя из фактической потребности Продавца и в соответствии с согласованным графиком и дополнительными условиями к настоящему Договору.

                    2.1.2. Приобретать пищевые отходы исключительно в целях приготовления корма или переработки на корма для животных фермерского или личного подсобного хозяйства. Покупатель обязан не продавать третьим лицам отходы, принятые у Продавца, не употреблять их в пищу, не выкидывать в мусорные баки ТБО и урны общего пользования.

                    2.2. Продавец обязан:

                    2.2.1. Не позднее, чем за 10 дней опубликовать предстоящие изменения настоящего Договора в сети Интернет: http://smaip.ru/dogovor.html и уведомить Покупателя в любой форме указанной в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора.

                    2.3. Подписывая настоящий Договор, Покупатель считается ознакомленным с дополнительными условиями, которые являются неотъемлемой частью настоящего Договора и размещены Продавцом в сети Интернет: http://smaip.ru/dopsoglashenie.html.
                    3. РАСЧЕТЫ И ПОРЯДОК ОПЛАТЫ

                    3.1. Передача пищевых отходов осуществляется по накладной. В накладной указывается номер и дата, наименование товара, его количество (в килограммах).

                    3.2. Стоимость пищевых отходов Продавец устанавливает в одностороннем порядке в срок не позднее 20-го числа предыдущего месяца и оповещает о ней Покупателя путем отправки квитанции любым способом, указанном в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора.

                    3.3. В случае, если Покупатель в течение месяца получит пищевые отходы свыше нормы, установленной настоящим договором, Продавец вправе потребовать доплату, путем выставления квитанции по установленному тарифу. Отправка квитанции осуществляется любым способом, указанном в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора. Покупатель обязан оплатить выставленную квитанцию в течение 3 календарных дней.

                    3.3.1. Продавец вправе установить еженедельную форму оплаты, в случае если из объекта в предыдущем месяце отгрузка была произведена свыше установленной нормы.

                    3.3.2. При установлении временной еженедельной оплаты Покупатель обязан произвести оплату не позднее суток с момента отправки квитанции согласно предоставленному весу отгрузки

                    3.4. Оплату за пищевые отходы Покупатель производит на следующий месяц авансовым платежом по квитанции в срок не позднее 24-го числа предыдущего месяца в безналичном порядке, путем перечисления на расчетный счет Продавца.

                    3.5. В случае нарушений условий настоящего договора Покупателем, возврат ранее внесенного платежа не производится.
                    4. ПРОЧИЕ УСЛОВИЯ

                    4.1. Любые изменения по настоящему Договору должны быть выполнены в письменной форме и подписаны Сторонами.

                    Письменная форма считается соблюденной и в случае совершения сделки с помощью электронных либо иных технических средств, позволяющих воспроизвести на материальном носителе в неизменном виде содержание сделки, при этом требование о наличии подписи считается выполненным, если использован любой способ, позволяющий достоверно определить Сторону настоящего Договора, в т.ч. посредством обмена письмами по электронной почте и личной переписки в мессенджерах (Telegram, Viber, WhatsApp).
                    5. ОТВЕТСТВЕННОСТЬ СТОРОН И СРОК ДЕЙСТВИЯ ДОГОВОРА

                    5.1. За неисполнение или ненадлежащее исполнение обязательств по настоящему договору Продавец и Покупатель несут ответственность в соответствии с действующим законодательством и дополнительными условиями к настоящему Договору.

                    5.2. В случае наложения государственными органами контроля, надзора (Администрация муниципального образования, Прокуратура, Роспотребнадзор, Росприроднадзор, Россельхознадзор и др.) штрафных санкций на Продавца в результате нарушения Покупателем условий договора, Покупатель по письменному требованию Продавца возмещает ему понесенные убытки в виде уплаченного административного штрафа в течение 5 (пяти) рабочих дней.

                    5.3. В случае несоблюдения Покупателем условий ежедневного вывоза пищевых отходов, в нарушение п.2.1.1 Договора, Продавец вправе требовать от Покупателя штраф в размере 800 (восемьсот) рублей за каждый факт не вывоза отходов в установленный срок, а также независимо от этого возместить причиненные убытки в полном объеме. В случае невывоза пищевого отхода Покупателем по его вине платеж по настоящему договору не возвращается.

                    5.4. В случае выявления факта продажи Покупателем пищевых отходов третьим лицам либо фактов утилизации пищевых отходов в мусорные баки ТБО, не принадлежащих Покупателю, и урны общего пользования, в нарушение п. 2.1.2. Договора, Продавец вправе требовать от Покупателя штраф в размере 100 000 рублей, а также независимо от этого возместить причиненные убытки в полном объеме.

                    5.5. Настоящий договор заключается на срок по 31 декабря текущего года и считается ежегодно продленным на тот же срок и на тех же условиях, если за 30 дней до окончания срока действия договора не последует письменного заявления одной из сторон о его расторжении или изменении.

                    5.6. Любая из сторон настоящего договора может расторгнуть настоящий договор с 1 числа следующего месяца, оповестив любым способом, указанном в п. 4.1 настоящего Договора, либо телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора. В случае несоблюдения Покупателем условий настоящего договора, Продавец оставляет за собой право расторгнуть договор в одностороннем порядке в день выявления нарушений, уведомив любым способом, указанном в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора.

                    С момента заключения настоящего Договора, все ранее заключенные Сторонами договоры утрачивают силу.
                    6. КОНФИДЕНЦИАЛЬНОСТЬ

                    6.1. Каждая из Сторон обязана соблюдать коммерческую тайну относительно конфиденциальной информации, полученной от другой Стороны в связи с исполнением обязательств по настоящему Договору.

                    6.2. Каждая из Сторон вправе вести запись телефонных переговоров в целях контроля за исполнением условий настоящего Договора.

                    6.3. Подписывая настоящий Договор, Покупатель дает согласие Продавцу на обработку своих персональных данных, а именно ФИО, данные документа, удостоверяющего личность, в т.ч. личные номера телефонов, государственный номер автомобиля, адрес электронной почты.

                    6.4. Сторона, в результате виновных действий которой произошло разглашение конфиденциальной информации, возмещает другой Стороне штраф в размере 50 000 рублей.

        </div>
    </div>
</template>

<script>
import { mapGetters } from 'vuex'
export default {
  name: 'Contract',
  computed: {
    ...mapGetters([
      'USER',
      'COMPANY'
    ])
  }
}
</script>
